# 주석달기
#파이썬에서는 #을 붙여서 나타냄
# vs code 단축키 ctrl+/
# vs code 실행은 컨트롤+f5

# 1+2의 결과를 출력
print(1+2) # 1+2의 결과를 출력
print(1-2) # 1-2의 결과를 출력
print(1*2) # 1*2의 결과를 출력
print(1/2) # 1/2의 결과를 출력
print(2**3) # **표시는 제곱을 나타냄
print(3/2) # 나누기
print(3//2) # 몫 연산자. 소수점 버리고 자연수만 남김
print(3%2) # 나머지를 구하는 연산자. 몫은 안나타남.
# python 연산자
# + 더하기
# - 빼기
# * 곱하기
# / 나누기
# ** 제곱
# // 정수 나누기 - 몫 연산자
# % 나머지 연산자 : 나누기에서 몫 빼고 나머지만 보여주는 연산자
# "" 안에 있는 글자는 문자로 인식(문자형 데이터). 수식이 있어도 계산 안함
print("1+2=", 1+2)
print("1-2=", 1-2)
print("1*2=", 1*2)
print("1/2=", 1/2)
print("2**3=",2**3)
print("3/2=",3/2)
print("3//2=",3//2)
print("3%2=",3%2)

print("안녕하세요")
print('반갑습니다')
print("여러분")
print("그는 생각했다.'생각생각생각'")
print('그녀는 말했다 "말말말"')
print("쌍따옴표 사용하기 \"사용\"") #\표시는 기능을 없앰. 기능없애고 문자로 쓸 수 있음 
#\n : 줄바꿈
#\t : 텝
#\" : 쌍따옴표 그대로 쓰기
#\' : 따옴표 그대로 쓰기
print('n')
print("\n")
print('n\n\tt')
print('''안녕하세요
반갑습니다
잘부탁드립니다
안녕히계세요''')
